suiaiyun/ymfc-32/ymfc-telemetry-stm32cubeide/User/usart/bsp_usart.h
#ifndef __BSP_USART_H
#define __BSP_USART_H

#include "stm32f10x.h"
#include <stdio.h>

#define DEBUG_USART1	1
#define DEBUG_USART2	0
#define DEBUG_USART3	0
#define DEBUG_USART4	0
#define DEBUG_USART5	0

#if DEBUG_USART1
// 串口1 - USART1
#define DEBUG_USARTx				USART1
#define DEBUG_USART_CLK				RCC_APB2Periph_USART1
#define DEBUG_USART_APBxClkCmd 		RCC_APB2PeriphClockCmd
#define DEBUG_USART_BAUDRATE		115200

// USART GPIO 引脚定义
#define DEBUG_USART_GPIO_CLK		(RCC_APB2Periph_GPIOA)
#define DEBUG_USART_GPIO_APBxClkCmd	RCC_APB2PeriphClockCmd
#define DEBUG_USART_TX_GPIO_PORT	GPIOA
#define DEBUG_USART_TX_GPIO_PIN		GPIO_Pin_9
#define DEBUG_USART_RX_GPIO_PORT	GPIOA
#define DEBUG_USART_RX_GPIO_PIN		GPIO_Pin_10

#define DEBUG_USART_IRQ				USART1_IRQn
#define DEBUG_USART_IRQHandler		USART1_IRQHandler

#elif DEBUG_USART2

// 串口1 - USART1
#define DEBUG_USARTx				USART2
#define DEBUG_USART_CLK				RCC_APB2Periph_USART2
#define DEBUG_USART_APBxClkCmd 		RCC_APB2PeriphClockCmd
#define DEBUG_USART_BAUDRATE		115200

// USART GPIO 引脚定义
#define DEBUG_USART_GPIO_CLK		(RCC_APB1Periph_GPIOA)
#define DEBUG_USART_GPIO_APBxClkCmd	RCC_APB1PeriphClockCmd
#define DEBUG_USART_TX_GPIO_PORT	GPIOA
#define DEBUG_USART_TX_GPIO_PIN		GPIO_Pin_2
#define DEBUG_USART_RX_GPIO_PORT	GPIOA
#define DEBUG_USART_RX_GPIO_PIN		GPIO_Pin_3

#define DEBUG_USART_IRQ				USART2_IRQn
#define DEBUG_USART_IRQHandler		USART2_IRQHandler

#elif DEBUG_USART3

// 串口1 - USART1
#define DEBUG_USARTx				USART1
#define DEBUG_USART_CLK				RCC_APB2Periph_USART1
#define DEBUG_USART_APBxClkCmd 		RCC_APB2PeriphClockCmd
#define DEBUG_USART_BAUDRATE		115200

// USART GPIO 引脚定义
#define DEBUG_USART_GPIO_CLK		(RCC_APB2Periph_GPIOA)
#define DEBUG_USART_GPIO_APBxClkCmd	RCC_APB2PeriphClockCmd
#define DEBUG_USART_TX_GPIO_PORT	GPIOA
#define DEBUG_USART_TX_GPIO_PIN		GPIO_Pin_9
#define DEBUG_USART_RX_GPIO_PORT	GPIOA
#define DEBUG_USART_RX_GPIO_PIN		GPIO_Pin_10

#define DEBUG_USART_IRQ				USART1_IRQn
#define DEBUG_USART_IRQHandler		USART1_IRQHandler

#elif DEBUG_USART4

// 串口1 - USART1
#define DEBUG_USARTx				USART1
#define DEBUG_USART_CLK				RCC_APB2Periph_USART1
#define DEBUG_USART_APBxClkCmd 		RCC_APB2PeriphClockCmd
#define DEBUG_USART_BAUDRATE		115200

// USART GPIO 引脚定义
#define DEBUG_USART_GPIO_CLK		(RCC_APB2Periph_GPIOA)
#define DEBUG_USART_GPIO_APBxClkCmd	RCC_APB2PeriphClockCmd
#define DEBUG_USART_TX_GPIO_PORT	GPIOA
#define DEBUG_USART_TX_GPIO_PIN		GPIO_Pin_9
#define DEBUG_USART_RX_GPIO_PORT	GPIOA
#define DEBUG_USART_RX_GPIO_PIN		GPIO_Pin_10

#define DEBUG_USART_IRQ				USART1_IRQn
#define DEBUG_USART_IRQHandler		USART1_IRQHandler

#elif DEBUG_USART5

// 串口1 - USART1
#define DEBUG_USARTx				USART1
#define DEBUG_USART_CLK				RCC_APB2Periph_USART1
#define DEBUG_USART_APBxClkCmd 		RCC_APB2PeriphClockCmd
#define DEBUG_USART_BAUDRATE		115200

// USART GPIO 引脚定义
#define DEBUG_USART_GPIO_CLK		(RCC_APB2Periph_GPIOA)
#define DEBUG_USART_GPIO_APBxClkCmd	RCC_APB2PeriphClockCmd
#define DEBUG_USART_TX_GPIO_PORT	GPIOA
#define DEBUG_USART_TX_GPIO_PIN		GPIO_Pin_9
#define DEBUG_USART_RX_GPIO_PORT	GPIOA
#define DEBUG_USART_RX_GPIO_PIN		GPIO_Pin_10

#define DEBUG_USART_IRQ				USART1_IRQn
#define DEBUG_USART_IRQHandler		USART1_IRQHandler

#endif


void USART_Config(void);
void Usart_SendByte(USART_TypeDef * pUSARTx, uint8_t data);
void Usart_SendStr(USART_TypeDef * pUSARTx, const char *str);

#endif /* __BSP_USART_H */
